<p style="text-align: justify;"><span style="color: #333300;"><strong><span style="text-decoration: underline;">1.Th&igrave; hiện tại đơn:<br /></span></strong></span><span style="color: #333300;"><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp;- Với c&aacute;c động từ th&ocirc;ng thường<br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + Verb (s/es) + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + do/does + not + Verb + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) +&nbsp;do/does + Subject&nbsp;+ Verb + Object<br /></strong>&nbsp;- Với động từ to-be:<br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + is/am/are + Noun/Adjective<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + is/am/are + not + Noun/Adjective<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + is/am/are + Subject&nbsp;+&nbsp;Noun/Adjective</strong><br /><strong>C&aacute;ch sử dụng:<br /></strong>&nbsp;- Mi&ecirc;u tả h&agrave;nh động lặp đi lặp lại hoặc một th&oacute;i quen<br /></span><span style="color: #333300;"><em>&nbsp; &nbsp;They watch television every evening after dinner (Họ xem ti vi mỗi tối sau khi ăn)</em><br />&nbsp;- Mi&ecirc;u tả trạng th&aacute;i hoặc khả năng hiện tại<br /></span><span style="color: #333300;">&nbsp; &nbsp;<em>He plays football very well (Cậu ấy chơi b&oacute;ng đ&aacute; rất hay)</em><br />&nbsp;- Mi&ecirc;u tả một sự thật hiển nhi&ecirc;n<br />&nbsp; &nbsp;<em>Moon goes around Eartch<br />&nbsp;</em>- Mi&ecirc;u tả lịch tr&igrave;nh, kế hoạch đ&atilde; được định sẵn<em><br />&nbsp; &nbsp;Train leaves station at 6 AM (T&agrave;u rời bến l&uacute;c 6 giờ s&aacute;ng)<br /></em><strong>Dấu hiệu nhận biết:<br />&nbsp;</strong>- Trong c&acirc;u c&oacute; c&aacute;c từ m&ocirc; tả sự thường xuy&ecirc;n, lặp đi lặp lại (usually, ofter, sometimes, every, never, ...)&nbsp;<br />&nbsp;- Trong c&acirc;u m&ocirc; tả số lần thực hiện (once, twice, three times,..)<br /><strong>Một số nguy&ecirc;n tắc sử dụng:<br /></strong>&nbsp;-&nbsp;Quy tắc th&ecirc;m s/es:<br />&nbsp; +&nbsp;S/es được th&ecirc;m v&agrave;o sau động từ trong th&igrave; hiện tại đơn khi chủ ngữ l&agrave; He, She, It v&agrave; c&aacute;c danh từ số &iacute;t kh&aacute;c.<br />&nbsp; + Th&ecirc;m es khi c&aacute;c động từ kết th&uacute;c với x, ch, z, s, sh, o (watches, goes, ...)<br />&nbsp; + Nếu động từ kết th&uacute;c với y m&agrave; trước đ&oacute; l&agrave; phụ &acirc;m, ta đổi y -&gt; i sau đ&oacute; th&ecirc;m es (study -&gt; studies)<br />&nbsp; + C&aacute;c trường hợp c&ograve;n lại ta sẽ th&ecirc;m s (play -&gt; plays, run -&gt; runs, ....)<br /></span></p>
<p style="text-align: justify;">&nbsp;</p>
<p><strong><span style="text-decoration: underline;">2.Th&igrave; hiện tại tiếp diễn (Present continous tense):</span><br /></strong><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + is/am/are + Verb-ing + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + is/am/are + not + Verb-ing + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + is/am/are + Subject&nbsp;+ Verb-ing + Object</strong><br /><strong>C&aacute;ch sử dụng:<br /></strong>&nbsp;- Mi&ecirc;u tả h&agrave;nh động được thực hiện tại thời điểm hiện tại<br /><em>&nbsp; &nbsp;They are eating together (Họ đang ăn c&ugrave;ng nhau)</em><br />&nbsp;- Mi&ecirc;u tả một h&agrave;nh động trong tương lai đ&atilde; được l&ecirc;n kế hoạch trước<br />&nbsp; &nbsp;<em>We are going on holiday tomorrow (Ch&uacute;ng t&ocirc;i sẽ đi nghỉ v&agrave;o ng&agrave;y mai)</em><em><br />&nbsp;</em>- M&ocirc; tả hoặc nhấn mạnh một chuỗi h&agrave;nh động lặp đi lặp lại theo &yacute; ph&agrave;n n&agrave;n, tr&aacute;ch m&oacute;c (thường d&ugrave;ng với always, forever, constantly )<br />&nbsp; &nbsp;She is always getting up late.<br /><em><br /></em><strong>Dấu hiệu nhận biết:<br />&nbsp;</strong>- Trong c&acirc;u c&oacute; c&aacute;c từ m&ocirc; tả thời điểm hiện tại như now, at the moment, currently, at the present,...<br />&nbsp;- Ph&iacute;a trước đ&oacute; l&agrave; c&acirc;u mệnh lệnh, cảm th&aacute;n (Look!, Oh no!, ...)<br /><strong>Một số lưu &yacute;:<br /></strong>&nbsp;- Thường kh&ocirc;ng d&ugrave;ng th&igrave; hiện tại tiếp diễn với c&aacute;c động từ sau:<br />&nbsp; + Động từ cảm nhận: hear, smell, taste, see, feel<br />&nbsp; + Động từ cảm x&uacute;c: fear, hate, like, love, ...<br />&nbsp; + Động từ bi&ecirc;ủ thị c&aacute;ch nh&igrave;n: believe, consider, assume, ...<br />&nbsp; + Động từ biểu thị sự hiểu biết: know, understand, understand, mean, ...<br />&nbsp; + Động từ đo lường: measure, cost, contain, ...</p>
<p><strong><span style="text-decoration: underline;">3.Th&igrave; hiện tại ho&agrave;n th&agrave;nh (Present perfect tense):<br /></span><br /></strong><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + have/has + Verb past participle + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + have/has + not + Verb past participle + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + have/has + Subject&nbsp;+ Verb past participle + Object<br /></strong><br /><strong>C&aacute;ch sử dụng:<br /></strong>&nbsp;- Mi&ecirc;u tả h&agrave;nh động &nbsp;bắt đầu trong qu&aacute; khứ v&agrave; vẫn c&ograve;n tiếp diễn ở hiện tại.<br /><em>&nbsp; &nbsp;I have been in Vietnam since 2000 (T&ocirc;i đ&atilde; ở Việt Nam từ năm 2000)</em><br />&nbsp;- Mi&ecirc;u tả một h&agrave;nh động vừa mới xảy ra<br />&nbsp; &nbsp;<em>I have just buy this bag with only 30$ (T&ocirc;i vừa mua c&aacute;i t&uacute;i n&agrave;y với gi&aacute; chỉ 30$)</em><br />&nbsp;- M&ocirc; tả h&agrave;nh động diễn ra trong qu&aacute; khứ, kh&ocirc;ng r&otilde; thời điểm nhưng c&oacute; hảnh hưởng đến hiện tại<br />&nbsp; <em>&nbsp;I have lost my phone (T&ocirc;i đ&atilde; l&agrave;m mất chiếc điện thoại của m&igrave;nh)</em><br />&nbsp;- Mi&ecirc;u tả h&agrave;nh động lặp đi lặp lại trong một khoản thời gian kh&ocirc;ng x&aacute;c định giữa qu&aacute; khứ v&agrave; hiện tại.<br />&nbsp; &nbsp;<em>Thay have visited Thailand many times</em><br /><em><br /></em><strong>Dấu hiệu nhận biết:<br />&nbsp;</strong>- Trong c&acirc;u th&igrave; hiện tại ho&agrave;n th&agrave;nh thường c&oacute; 1 trong c&aacute;c từ sau:<br />&nbsp; + Already: rồi<br />&nbsp; + Just, recently, lately: vừa mới<br />&nbsp; + Yet: chưa<br />&nbsp; + So far, ulti now, up to now, up to present: cho tới b&acirc;y giờ<br />&nbsp; + Since + mốc thời gian: từ &nbsp;(since 2000, since September, ...)<br />&nbsp; + For + khoảng thời gian: trong (for 2 years, for a month, ...)<br /><strong><br /><span style="text-decoration: underline;">4.Th&igrave; hiện tại ho&agrave;n th&agrave;nh tiếp diễn (Present perfect continous tense):</span></strong><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + have/has + been +Verb-ing + Object</strong><br />&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + have/has + not + been + Verb-ing + Object</strong><br />&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + have/has + Subject&nbsp;+ been + Verb-ing + Object</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Mi&ecirc;u tả h&agrave;nh động &nbsp;bắt đầu trong qu&aacute; khứ v&agrave; vẫn c&ograve;n tiếp diễn ở hiện tại nhưng c&oacute; &yacute; nhấn mạnh v&agrave;o sự tiếp diễn trong hiện tại<br /><em>&nbsp; &nbsp;I have been waiting here for an hour (T&ocirc;i đ&atilde; phải chờ ở đ&acirc;y cả tiếng)</em><br /><em><br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Trong c&acirc;u th&igrave; hiện tại ho&agrave;n th&agrave;nh thường c&oacute; 1 trong c&aacute;c từ sau:<br />&nbsp; + Since + mốc thời gian: từ &nbsp;(since 2000, since September, ...)<br />&nbsp; + For + khoảng thời gian: trong (for 2 years, for a month, ...)<strong><br /></strong>&nbsp; + All + danh từ thời gian (all day, all week<br /><br /><span style="text-decoration: underline;"><strong>5.Th&igrave; qu&aacute; khứ đơn (Simple past tense):</strong></span><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + Verb past + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + did + not + Verb infinitive&nbsp;+ Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + did + Subject&nbsp;+ Verb infinitive&nbsp;+ Object<br /></strong>&nbsp;- Với động từ to-be:<br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + was/were + Noun/Adjective<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + was/were + not + Noun/Adjective<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + was/were + Subject&nbsp;+&nbsp;Noun/Adjective</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Mi&ecirc;u tả h&agrave;nh động bắt đầu v&agrave; kết th&uacute;c trong qu&aacute; khứ<br /><em>&nbsp; &nbsp;He left school 3 years ago (Cậu ấy rời khỏi trường học 3 năm trước)<br /></em>&nbsp;- Mi&ecirc;u tả h&agrave;nh động chen ngang một h&agrave;nh động kh&aacute;c trong qu&aacute; khứ.<br />&nbsp; &nbsp;<em>When I was sleeping, thief entered my house (Khi t&ocirc;i đang ngủ, t&ecirc;n trộm đ&atilde; đột nhập v&agrave;o nh&agrave;)</em><br /><em><br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Trong c&acirc;u c&oacute; c&aacute;c từ mi&ecirc;u tả thời gian trong qu&aacute; khứ như yesterday, last year, last night, an hour ago, ...<br /><strong>Một số lưu &yacute; khi sử dụng:</strong><br />&nbsp;- C&aacute;c chia động từ to-be:<br />&nbsp; + was: khi chủ ngữ l&agrave; I, He, She, It v&agrave; c&aacute;c danh từ số &iacute;t<br />&nbsp; + Were: khi chủ ngữ l&agrave; we, they, you v&agrave; c&aacute;c danh từ số nhiều<br />&nbsp;- C&aacute;c động từ th&ocirc;ng thường sẽ được th&ecirc;m ed v&agrave;o cuối động từ, ngo&agrave;i ra sẽ c&oacute; c&aacute;c động từ bất quy tắc, c&aacute;c bạn c&oacute; thể xem th&ecirc;m ở<br />&nbsp;- C&aacute;ch th&ecirc;m ed v&agrave;o sau c&aacute;c động từ thường:<br />&nbsp; + Th&ocirc;ng thường c&aacute;c động từ sẽ được th&ecirc;m ed ở thể qu&aacute; khứ (watched, visited)<br />&nbsp; + Với c&aacute;c động từ kết th&uacute;c bằng e -&gt; ta chỉ th&ecirc;m d (agreed, typed)<br />&nbsp; + Với c&aacute;c động từ một &acirc;m tiết, kết th&uacute;c l&agrave; 1 phụ &acirc;m, đứng trước l&agrave; 1 nguy&ecirc;n &acirc;m -&gt; ta gấp đ&ocirc;i phụ &acirc;m cuối rồi th&ecirc;m ed (stopped, skipped, planned, fitted)<br />&nbsp; + Với động từ kết th&uacute;c bằng y, v&agrave; trước y l&agrave; một nguy&ecirc;n &acirc;m -&gt; ta th&ecirc;m ed b&igrave;nh thường (played)<br />&nbsp; + Với động từ kết th&uacute;c bằng y, v&agrave; trước y l&agrave; một phụ &acirc;m -&gt; ta chuyển y th&agrave;nh i rồi th&ecirc;m ed (studied)</p>
<p><strong>6.Th&igrave; qu&aacute; khứ tiếp diễn (Past continous tense):</strong><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + was/were +V-ing + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + was/were + not + V-ing&nbsp;+ Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + was/were + Subject&nbsp;+ V-ing&nbsp;+ Object</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Mi&ecirc;u tả h&agrave;nh động đang diễn ra tại một thời điểm x&aacute;c định trong qu&aacute; khứ<br /><em>&nbsp; &nbsp;At 8 o'clock this morning, I was reading book in library<br /></em>&nbsp;- Mi&ecirc;u tả h&agrave;nh động đang xảy ra trong qu&aacute; khứ th&igrave; bị chen ngang bởi một h&agrave;nh động kh&aacute;c.<br />&nbsp; &nbsp;<em>When I was sleeping, thief entered my house (Khi t&ocirc;i đang ngủ, t&ecirc;n trộm đ&atilde; đột nhập v&agrave;o nh&agrave;)</em><br /><em><br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Trong c&acirc;u c&oacute; ghi r&otilde; một thời điểm cụ thể trong qu&aacute; khứ (at 10:00 )<br /><strong>Một số lưu &yacute; khi sử dụng:</strong></p>
<p><strong>7.Th&igrave; qu&aacute; khứ ho&agrave;n th&agrave;nh (Past perfect tense):</strong><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + had +Verb past participle&nbsp;+ Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + had + not + Verb past participle&nbsp; + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + had + Subject&nbsp;+ Verb past participle + Object</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Mi&ecirc;u tả h&agrave;nh động ho&agrave;n th&agrave;nh trước một h&agrave;nh động kh&aacute;c trong qu&aacute; khứ<br /><em>&nbsp; &nbsp;The train had just left when I arrived at the station.</em><br /><em><br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Th&igrave; qu&aacute; khứ ho&agrave;n th&agrave;nh thường được d&ugrave;ng trong c&acirc;u c&oacute; 2 h&agrave;nh động diễn ra trước sau n&ecirc;n thường c&oacute; c&aacute;c từ:<br />&nbsp; + When/ by the time: khi/v&agrave;o thời điểm<br /><em>&nbsp; &nbsp; &nbsp;By the time I started my exam, He had finished it already (V&agrave;o thời điểm t&ocirc;i bắt đầu l&agrave;m b&agrave;i kiểm tra, cậu ấy đ&atilde; l&agrave;m xong rồi)</em><br />&nbsp; + Before/After:<br />&nbsp; &nbsp; &nbsp;I had gone out before they came. (T&ocirc;i đ&atilde; đi ra ngo&agrave;i trước khi họ đến)<br />&nbsp; + Just: vừa mới<br />&nbsp; &nbsp; &nbsp;She had just finish her task when boss asked. (C&ocirc; ấy vừa kịp ho&agrave;n th&agrave;nh c&ocirc;ng việc khi &ocirc;ng chủ hỏi)<br /><strong>Một số lưu &yacute; khi sử dụng:</strong></p>
<p><strong>8.Th&igrave; qu&aacute; khứ ho&agrave;n th&agrave;nh tiếp diễn (Past perfect continous tense):</strong><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + had + been +Verb-ing + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + had + not + been + Verb-ing + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + had + Subject + been + Verb-ing + Object</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Mi&ecirc;u tả h&agrave;nh động đang diễn ra trước một h&agrave;nh động, hoặc một thời điểm trong qu&aacute; khứ<br /><em>&nbsp; &nbsp;I had been waiting at cinema before you came. (T&ocirc;i đ&atilde; ngồi chờ tại rạp chiếu phim trước khi bạn tới).<br /></em>&nbsp; &nbsp;He had been talking with fiends for an hour before 10 pm last night. (Cậu ấy đ&atilde; n&oacute;i chuyện với bạn b&egrave; suốt một tiếng v&agrave;o trước 10 giờ tối qua).<br /><em><br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Trong c&acirc;u c&oacute; c&aacute;c từ: before, after, by the time, until then, prior to that time.<br /><em>&nbsp; &nbsp;He had been thinking about of taking a trip by the time he finished course (Cậu ấy đ&atilde; suy nghĩ về việc c&oacute; một kỳ nghĩ v&agrave;o thời điểm kết th&uacute;c kho&aacute; học).</em></p>
<p><strong>9.Th&igrave; tương lai đơn (Simple future):</strong><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + shall/will +Verb infinitive + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + shall/will + not + Verb infinitive + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + shall/will + Subject + Verb infinitive + Object</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Diễn tả một dự đo&aacute;n trong tương lại<br /><em>&nbsp; &nbsp;I will rain tonight (Trời sẽ mưa v&agrave;o tối nay).<br /></em>&nbsp;- Diễn tả một dự định trong tương lai nhưng chưa c&oacute; kế hoạch cụ thể hoặc dự định bộc ph&aacute;t khi n&oacute;i<br /><em>&nbsp; &nbsp;I will become a doctor someday (T&ocirc;i sẽ trở th&agrave;nh một b&aacute;c sĩ v&agrave;o ng&agrave;y n&agrave;o đ&oacute;).<br /></em>&nbsp;- Khi đưa ra một quyết định tức thời (thường d&ugrave;ng với I, we)<br /><em>&nbsp; &nbsp;I'll pay for that bill (t&ocirc;i sẽ trả tiền cho ho&aacute; đơn đ&oacute;)<br /></em><em><br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Trong c&acirc;u c&oacute; c&aacute;c từ chỉ đến thời điểm trong tương lai (tonight, tomorrow, next week, next year, ...)<br /><br /><strong>Một số lưu &yacute; khi sử dụng:</strong><br />&nbsp;- C&aacute;ch sử dụng shall/will<br />&nbsp; + Will: thường được d&ugrave;ng phổ biến v&agrave; được &aacute;p dụng cho mọi ng&ocirc;i trong th&igrave; &nbsp;tương lai đơn.<br />&nbsp; + Shall: thường được d&ugrave;ng với ng&ocirc;i I, we d&ugrave;ng để đưa ra một lời mời, một đề suất hoặc hỏi một sự khuy&ecirc;n bảo từ người đối diện</p>
<p><strong>10.Th&igrave; tương lai tiếp diễn (Future continous):</strong><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + shall/will + be +Verb-ing + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + shall/will + not + be +Verb-ing + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + shall/will + Subject +&nbsp;be +Verb-ing + Object</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Diễn tả một h&agrave;nh động diễn ra v&agrave;o một thời điểm x&aacute;c định trong tương lai.<br /><em>&nbsp; &nbsp;I will be going shopping at this time tomorrow (T&ocirc;i sẽ đi mua sắm v&agrave;o giờ n&agrave;y ng&agrave;y mai)<br /></em>&nbsp;- Diễn tả một h&agrave;nh động c&oacute; thể đang xảy ra trong tương lai khi c&oacute; một h&agrave;nh động kh&aacute;c<br /><em>&nbsp; &nbsp;I guess he will be waiting at home when I come tomorrow (T&ocirc;i đo&aacute;n cậu ấy sẽ đang chờ t&ocirc;i ở nh&agrave; khi t&ocirc;i đến v&agrave;o ng&agrave;y mai)<br /></em><em><br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Trong c&acirc;u c&oacute; c&aacute;c từ chỉ thời điểm cụ thể trong tương lai:<br />&nbsp; + At this time/At this moment + thời gian tương lai: tại thời điểm n&agrave;y trong tương lai.<br />&nbsp; + Một mốc thời gian tương lai cụ thể (at 10 o'clock tomorrow, ...)<br /><br /><strong>11.Th&igrave; tương lai ho&agrave;n th&agrave;nh (Future perfect tense):</strong><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + shall/will + have +Verb past pariciple + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + shall/will + not + have +Verb past pariciple + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + shall/will + Subject +&nbsp;have +Verb past pariciple + Object</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Diễn tả một h&agrave;nh động sẽ được ho&agrave;n th&agrave;nh trong tương lai trước một thời điểm hoặc một h&agrave;nh động kh&aacute;c<br /><em>&nbsp; &nbsp;I will have finished this tast by 10 o'clock tomorrow (T&ocirc;i sẽ ho&agrave;n th&agrave;nh nhiệm vụ n&agrave;y trước 10 giờ n&agrave;y mai)</em><br /><em>&nbsp; &nbsp;She will have visited his sister before she return home at September. (C&ocirc; ấy sẽ đi thăm chị g&aacute;i trước khi về nh&agrave; v&agrave;o th&aacute;ng 9).<br /></em><em><br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Trong c&acirc;u c&oacute; c&aacute;c từ by/before/by the end of + thời gian trong tương lai.</p>
<p><strong>12.Th&igrave; tương lai ho&agrave;n th&agrave;nh tiếp diễn (Future perfect continous tense):</strong><br /><strong>Cấu tr&uacute;c c&acirc;u:</strong><br />&nbsp; +&nbsp;Khẳng định: &nbsp; &nbsp;<strong>Subject + shall/will + have been +Verb-ing + Object<br /></strong>&nbsp; + Phủ định: &nbsp; &nbsp; &nbsp; &nbsp;<strong>Subject + shall/will + not + have been +Verb-ing + Object<br /></strong>&nbsp; + Nghi vấn: &nbsp; &nbsp; &nbsp; &nbsp;<strong>(Wh) + shall/will + Subject + have been +Verb-ing + Object</strong><br /><strong>C&aacute;ch sử dụng:</strong><br />&nbsp;- Diễn tả một h&agrave;nh động chưa kết th&uacute;c v&agrave;o thời điểm hiện tại m&agrave; c&oacute; thể kết th&uacute;c v&agrave;o một thời điểm trong tương lai.<br /><em>&nbsp; + By the end of this month, I will have been living in Vietnam for 3 years (V&agrave;o cuối th&aacute;ng n&agrave;y, t&ocirc;i đ&atilde; sống ở Việt Nam trong 3 năm)<br /></em><strong>Dấu hiệu nhận biết:</strong><br />&nbsp;- Trong c&acirc;u c&oacute; c&aacute;c từ by/before + mốc thời gian trong tương lai, sau đ&oacute; l&agrave; for + khoảng thời gian</p>
<p><br /><br /><br /><br /><br />&nbsp;<strong><br /></strong></p>
