<p style="text-align: justify;"><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><u><strong>1. In (Trong) &nbsp;+ mốc thời gian:</strong></u></span></span><span style="font-size: 18px;"><span style="color: rgb(51, 51, 0);"><br>- D&ugrave;ng để chỉ năm, c&aacute;c m&ugrave;a c&aacute;c th&aacute;ng (In 2018, in summer, in september,&hellip;)<br><em>&nbsp; I visited Thailand in 2018 (T&ocirc;i đ&atilde; đi Th&aacute;i Lan v&agrave;o năm 2018)<br>&nbsp; We go back school in September (Ch&uacute;ng t&ocirc;i quay lại trường học v&agrave;o th&aacute;ng 9)</em></span></span><br>
    <span
        style="font-size: 18px;"><span style="color: rgb(51, 51, 0);">- D&ugrave;ng để chỉ c&aacute;c buổi trong ng&agrave;y (ngoại trừ night) (in the morning, in the afternoon,...)<br>  <em>&nbsp; I get up at 7 o&rsquo;clock in the morning (T&ocirc;i thức dậy v&agrave;o l&uacute;c 7 giờ buổi s&aacute;ng)<br>&nbsp; She knew the result in the afternoon (C&ocirc; ấy đ&atilde; biết kết quả v&agrave;o buổi chiều)</em><br>- D&ugrave;ng để chỉ trong một khoảng thời gian (In a minute, in an hour,...).<br>  <em>&nbsp; Please finish this task in an hour (L&agrave;m ơn kết th&uacute;c c&ocirc;ng việc n&agrave;y trong 1 giờ)</em></span></span><br>
        <span
            style="font-size: 18px;"><span style="color: rgb(51, 51, 0);"><em>&nbsp; I think we could go around Hanoi in a day (T&ocirc;i nghĩ ch&uacute;ng ta c&oacute; thể đi dạo quanh H&agrave; Nội trong một v&agrave;o)</em></span></span>
</p>
<p style="text-align: justify;"><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>2. At (v&agrave;o l&uacute;c) &nbsp;+ mốc thời gian:</u></strong></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ giờ v&agrave; mốc thời gian trong ng&agrave;y (At 2 o&rsquo;clock, at noon, at midnight, at night,...)<br><em>&nbsp; He goes swimming at 6 o&rsquo;clock everyday (Cậu ta đi bơi v&agrave;o 6 giờ s&aacute;ng mỗi ng&agrave;y).<br>&nbsp; At midnight, the Moon is very bright (V&agrave;o giữa đ&ecirc;m, mặt trăng rất s&aacute;ng)</em><br>- D&ugrave;ng để chỉ c&aacute;c dịp lễ (At Christmas, at Easter,...)<br> <em>&nbsp; We eat so much at Christmas (Ch&uacute;ng ta ăn rất nhiều v&agrave;o dịp lễ gi&aacute;ng sinh)<br></em>- Thường d&ugrave;ng trong 1 cụm để chỉ mốc thời gian (At the moment, at this time, at that time,...)<br><em>&nbsp; At the moment, she is cooking in the kitchen (Hiện tại, c&ocirc; ấy đang nấu ăn trong bếp)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><u><strong>3. On (v&agrave;o ng&agrave;y) &nbsp;+ mốc thời gian:</strong></u></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ ng&agrave;y cụ thể hoặc ng&agrave;y trong tuần (On the 12 of July, on June 20th, on Monday, on Tuesday,...)<br><em>&nbsp; We usually go shopping on Saturday (Ch&uacute;ng t&ocirc;i thường đi mua sắm v&agrave;o thứ 7).<br>&nbsp; On June 17th, I got a new job (V&agrave;o ng&agrave;y 17 th&aacute;ng 6, t&ocirc;i đ&atilde; c&oacute; một c&ocirc;ng việc mới)</em><br>- D&ugrave;ng để chỉ c&aacute;c ng&agrave;y lễ cụ thể (On Christmas Day, on Easter Day,...)<br><em>&nbsp; I will invite my girlfriend to go to cinema on Christmas Day (T&ocirc;i sẽ mời bạn g&aacute;i đi xem phim v&agrave;o ng&agrave;y gi&aacute;ng sinh)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><u><strong>4. Before/After (trước/sau) + mốc thời gian:</strong></u></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ trước hoặc sau thời gian/c&ocirc;ng việc n&agrave;o đ&oacute; (before Monday, after breakfast,...)<br><em>&nbsp; We brush our teeth before going sleep (Ch&uacute;ng ta đ&aacute;nh răng trước khi đi ngủ)<br>&nbsp; I take a rest after lunch (t&ocirc;i nghỉ ngơi một ch&uacute;t sau buổi trưa).</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>5. Ago (trước đ&acirc;y):</u></strong></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ khoảng thời gian về trước (3 years ago, a week ago)<br><em>&nbsp; I saw this film a week ago (T&ocirc;i đ&atilde; xem ph&igrave;m n&agrave;y 1 tuần trước).<br>&nbsp; I graduated 2 years ago (T&ocirc;i đ&atilde; tốt nghiệp 2 năm trước).</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><u><strong>6. Between (giữa) + 2 mốc thời gian:</strong></u></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ giữa 2 khoảng thời gian (between breakfast and lunch)<br><em>&nbsp; I have an exam between Tuesday and Friday (T&ocirc;i c&oacute; một b&agrave;i kiểm tra giữa thứ 3 v&agrave; thứ 6)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><u><strong>7. By (trước, bằng) + mốc thời gian:</strong></u></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ trước v&agrave; kh&ocirc;ng qu&aacute; mốc thời gian n&agrave;o đ&oacute; (by Monday, by afternoon,...)<br><em>&nbsp; Can you tell me your decision by Monday? (Bạn c&oacute; n&oacute;i cho t&ocirc;i quyết định của bạn trước thứ 2 được kh&ocirc;ng?)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><u><strong>8. For (trong v&ograve;ng) + khoảng thời gian:</strong></u></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ khoảng thời gian nhất định (for 2 weeks, for 1 day,...)<br><em>&nbsp; I have lived in Vietnam for 3 years (T&ocirc;i đ&atilde; sống ở Việt Nam được 3 năm)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><u><strong>9. During (trong suốt) (khoảng thời gian):</strong></u></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ trong khoảng thời gian n&agrave;o đ&oacute; (during holidays, during weekends,...)<br><em>&nbsp; I stayed in my hometown during weekends (T&ocirc;i đ&atilde; ở qu&ecirc; trong suốt cuối tuần)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>10. From &hellip; to/till/until (từ &hellip; đến/cho đến):</u></strong></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ từ 1 mốc thời gian đến một mốc thời gian kh&aacute;c (from Monday to Thursday, from morning to afternoon,...)<br><em>&nbsp; From Monday to Friday last week, he worked at home (Từ thứ 2 đến thứ 6 tuần trước, cậu ấy đ&atilde; l&agrave;m việc ở nh&agrave;)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>11. Since (từ) + mốc thời gian:</u></strong></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để n&oacute;i một mốc thời gian trong qu&aacute; khứ (since 2001, since last night,...)<br><em>&nbsp; I have started playing tennis since 2017 (T&ocirc;i bắt đầu chơi quần vợt từ năm 2017)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>12. Till/until (đến, cho đến) + mốc thời gian:</u></strong></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để n&oacute;i sự việc diễn ra tới một mốc trong tương lai (till tomorrow, until September,...)<br><em>&nbsp; It will rain till tomorrow (Trời sẽ mưa cho tới ng&agrave;y mai).</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>13. Up to + khoảng thời gian:</u></strong></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để n&oacute;i đến khoảng thời gian tối đa (up to an hour, up to 2 weeks,...)<br><em>&nbsp; I can spend up to 3 hours per day to learn English (T&ocirc;i c&oacute; thể d&agrave;nh tối đa 3 tiếng một ng&agrave;y để học tiếng anh)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>14. Within (trong khoảng) + khoảng thời gian:&nbsp;</u></strong></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ trong khoảng thời gian n&agrave;o đ&oacute; (within a day, within a week,...)<br><em>&nbsp; I can do this task within a day (T&ocirc;i c&oacute; thể l&agrave;m việc n&agrave;y trong một ng&agrave;y)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>15. Past/to (đ&atilde; qua/l&agrave; tới):</u></strong></span></span><span style="color: rgb(51, 51, 0);"><span style="font-size: 18px;"><br>- D&ugrave;ng để chỉ giờ trong ng&agrave;y, thường tham chiếu tới một giờ cụ thể (half past 10 -&gt; 10h30, 20 minutes to 10 -&gt; 9h40)<br><em>&nbsp; It&rsquo;s half past ten now (B&acirc;y giờ l&agrave; 10 rưỡi).</em></span></span>
</p>
