<p dir="ltr"><span style="color: #00008b;"><span style="font-size: 24px;"><strong><u>1. Đại từ nh&acirc;n xưng:</u></strong></span></span><span style="font-size: 18px; color: #333300;"><br>- D&ugrave;ng để thay thế cho danh từ hoặc cụm danh từ để tr&aacute;nh sự lặp lại kh&ocirc;ng cần thiết, l&agrave;m c&acirc;u tối giản<br>- Đại từ nh&acirc;n xưng c&oacute; 2 dạng l&agrave; chủ ngữ v&agrave; t&acirc;n ngữ:</span><br>
    <span
        style="font-size: 18px; color: #333300;">- C&aacute;c dạng đại từ nh&acirc;n xưng:<br> + Ng&ocirc;i thứ nhất số &iacute;t: I - me (chủ ngữ - t&acirc;n ngữ)<br> <em>&nbsp; &nbsp;I have a pen (T&ocirc;i c&oacute; một c&acirc;y b&uacute;t)<br>&nbsp; &nbsp;He gives me a pen (Cậu ấy đưa t&ocirc;i một c&acirc;y b&uacute;t)</em></span><br>
        <span
            style="font-size: 18px; color: #333300;">&nbsp;+ Ng&ocirc;i thứ hai số &iacute;t: you - you<br> <em>&nbsp; &nbsp;You can do it later (Bạn c&oacute; thể l&agrave;m việc đ&oacute; sau)<br>&nbsp; &nbsp;Mary will meet you tomorrow (Mary sẽ gặp bạn v&agrave;o ng&agrave;y mai)</em><br> + Ng&ocirc;i
            thứ ba số &iacute;t: he, she, it - him, her, it<br> <em>&nbsp; &nbsp;He want to go swimming (Cậu ta muốn đi bơi)</em></span><br><span style="font-size: 18px; color: #333300;"><em>&nbsp; &nbsp;I take him to swimming pool (T&ocirc;i sẽ đưa cậu ấy đến bể bơi)<br>  She don&rsquo;t want to go to the party. (C&ocirc; ấy kh&ocirc;ng muốn đi đến buổi tiệc)<br>&nbsp; &nbsp;I invited her come to my party (T&ocirc;i đ&atilde; mời c&ocirc; ấy đến buổi tiệc của m&igrave;nh)</em></span><em><br></em>            <span style="color: #333300;"><span style="font-size: 18px;"><em>&nbsp; &nbsp;It&rsquo;s mine (N&oacute; l&agrave; của t&ocirc;i)<br>&nbsp; &nbsp;I need it for presentation (T&ocirc;i cần n&oacute; cho buổi thuyết tr&igrave;nh)</em><br> + Ng&ocirc;i thứ nhất số nhiều: we - us<br> <em>&nbsp; &nbsp;We will have a small party at weekend (Ch&uacute;ng t&ocirc;i sẽ c&oacute; một buổi tiệc nhỏ v&agrave;o cuối tuần)</em><br> <em>&nbsp; &nbsp;He gave us 10$ to buy that cake (&Ocirc;ng ấy đưa cho ch&uacute;ng t&ocirc;i 10$ để mua c&aacute;i b&aacute;nh kem đ&oacute;)</em><br> + Ng&ocirc;i thứ hai số nhiều: you - you<br></span>
            <span
                style="font-size: 18px;"><em>&nbsp; &nbsp;All of you can go if you want (Tất cả c&aacute;c bạn c&oacute; thể đi nếu c&aacute;c bạn muốn)<br>&nbsp; &nbsp;I&rsquo;ll introduce for you about school policy now (T&ocirc;i sẽ giới thiệu cho c&aacute;c bạn về ch&iacute;nh s&aacute;ch của trường ngay b&acirc;y giờ)</em><br>                + Ng&ocirc;i thứ ba số nhiều: they - them<br> <em>&nbsp; &nbsp;They want to visit Paris for 2 weeks (Họ muốn thăm Paris trong 2 tuần)<br>&nbsp; &nbsp;You should ask them about direction (Bạn n&ecirc;n hỏi họ về sự hướng dẫn)</em></span>
                </span>
</p>
<p dir="ltr"><span style="color: #00008b;"><span style="font-size: 24px;"><strong><u>2. Đại từ sở hữu:</u></strong></span></span><span style="color: #333300;"><span style="font-size: 18px;"><br>- D&ugrave;ng để thay thế cho t&iacute;nh từ sở hữu để tr&aacute;nh sự lặp lại kh&ocirc;ng cần thiết, l&agrave;m c&acirc;u tối giản</span></span><br>
    <span
        style="color: #333300;"><span style="font-size: 18px;">- Ng&ocirc;i thứ nhất số &iacute;t: I - my - mine (Đại từ nh&acirc;n xưng - t&iacute;nh từ sở hữu - Đại từ sở hữu)<br>- Ng&ocirc;i thứ hai số &iacute;t: you - your - yours<br>- Ng&ocirc;i thứ ba số &iacute;t: he - his - his, she - her - hers, it - its - its<br>- Ng&ocirc;i thứ nhất số nhiều: we - our - ours<br>- Ng&ocirc;i thứ hai số nhiều: you - your - yours<br>- Ng&ocirc;i thứ ba số nhiều: they - their - theirs <br></span></span>
        <span style="color: #00008b;"><span style="font-size: 24px;"><strong><u>3. Đại từ phản th&acirc;n:</u></strong></span></span><span style="color: #333300;"><span style="font-size: 18px;"><br>- D&ugrave;ng l&agrave;m t&acirc;n ngữ của động từ nếu như chủ ngữ v&agrave; t&acirc;n ngữ l&agrave; một<br>  He blamed himself for that mistake (Cậu ấy tự tr&aacute;ch m&igrave;nh v&igrave; sai lầm đ&oacute;)<br>- D&ugrave;ng l&agrave;m t&acirc;n ngữ sau giới từ nếu như t&acirc;n ngữ n&agrave;y giống với chủ ngữ<br> <em>&nbsp; I do it for myself. (I l&agrave;m cho ch&iacute;nh m&igrave;nh)<br></em>- Một số trường hợp d&ugrave;ng để nhấn mạnh chủ ngữ, t&acirc;n ngữ<br> <em>&nbsp; Andy himself built a library (Ch&iacute;nh Andy đ&atilde; x&acirc;y dựng một c&aacute;i thư viện)<br>&nbsp; I met Obama himself (T&ocirc;i đ&atilde; gặp Obama)</em><br>- C&aacute;c dạng đại từ phản th&acirc;n:<br> + Ng&ocirc;i thứ nhất số &iacute;t: I - myself (Đại từ nh&acirc;n xưng - t&iacute;nh từ sở hữu - Đại từ sở hữu)<br> <em>&nbsp; &nbsp;I cook breakfast for myself every morning (T&ocirc;i nấu bữa s&aacute;ng cho ch&iacute;nh m&igrave;nh v&agrave;o mỗi buổi s&aacute;ng)<br></em> + Ng&ocirc;i thứ hai số &iacute;t: you - yourself<br> <em>You can draw it for yourself (Bạn c&oacute; thể vẽ c&aacute;i đ&oacute; cho m&igrave;nh)<br></em> + Ng&ocirc;i thứ ba số &iacute;t: he - himself, she - herself, it - itself<br> <em>&nbsp; &nbsp;He hurts himself when use knife to cook (Cậu ấy tự l&agrave;m bị thương khi d&ugrave;ng dao để nấu)<br>   She saw herself in the mirror (C&ocirc; ấy tự nh&igrave;n m&igrave;nh trong gương)<br>&nbsp; &nbsp;That machine pushes itself forward (C&aacute;i m&aacute;y đ&oacute; tự đẩy l&ecirc;n trước)</em><br> + Ng&ocirc;i thứ nhất số nhiều: we - ourselves<br> <em>&nbsp; &nbsp;We have to improve ourselves for the contest (Ch&uacute;ng t&ocirc;i phải tự cải thiện bản th&acirc;n cho cuộc thi)<br></em> + Ng&ocirc;i thứ hai số nhiều: you - yourselves<br> <em>&nbsp; &nbsp;You can cook for yourselves together (C&aacute;c bạn c&oacute; thể tự nấu ăn c&ugrave;ng nhau)<br></em> + Ng&ocirc;i thứ ba số nhiều: they - themselves <br><em>&nbsp; &nbsp;Tom and his friends make themselves a robot from bottles (Tom v&agrave; bạn của cậu ấy tự l&agrave;m một con robot từ những c&aacute;i chai)</em></span></span>
</p>
<p dir="ltr"><span style="color: #00008b;"><span style="font-size: 24px;"><strong><u>4. Đại từ quan hệ:</u></strong></span></span><span style="color: #333300;"><span style="font-size: 18px;"><br>- D&ugrave;ng trong mệnh đề quan hệ để bổ sung th&ecirc;m th&ocirc;ng tin cho c&aacute;c mệnh đề trong c&acirc;u<br>- C&aacute;c loại đại từ quan hệ:<br>&nbsp;+ Who: d&ugrave;ng để đại diện cho một người hoặc một nh&oacute;m người</span></span><br>
    <span
        style="color: #333300;"><span style="font-size: 18px;">&nbsp; &nbsp;<em>That is Andy, who got highest score in English exam (Đ&oacute; l&agrave; Andy, người đ&atilde; đạt được điểm cao nhất trong kỳ thi tiếng Anh)</em><br> + Which: d&ugrave;ng để đại diện cho vật, sự vật, hiện tượng <br><em>&nbsp; &nbsp;I have just read a book which gave me so much knowledge about computer (T&ocirc;i vừa đọc một cuốn s&aacute;ch m&agrave; đ&atilde; cho t&ocirc;i rất nhiều kiến thức về m&aacute;y t&iacute;nh)</em><br> + Whose: d&ugrave;ng để đại diện cho sự sở hữu người hoặc vật<br><em>&nbsp; &nbsp;This is Steven whose father is a president<br></em> + Whom: đại diện cho người d&ugrave;ng l&agrave;m t&acirc;n ngữ<br><em>&nbsp; &nbsp;The boy whom I met yesterday invited me to his birthday party <br></em> + That: thường được d&ugrave;ng l&agrave;m chủ ngữ để đại diện cho người, vật, hiện tượng.<br><em>&nbsp; &nbsp;It was a terrible accident that many people died. (Đ&oacute; l&agrave; một tai nạn tồi tệ khi c&oacute; nhiều người chết)</em></span></span>
</p>
<p><span style="color: #00008b;"><span style="font-size: 24px;"><strong><u>5. Đại từ chỉ định:&nbsp;</u></strong></span></span>
</p>
<p><span style="color: #333300;"><span style="font-size: 18px;">- Thường đi k&egrave;m với danh từ hoặc đứng độc lập nhằm l&agrave;m r&otilde; th&ecirc;m danh từ</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">- C&aacute;c đại từ chỉ định th&ocirc;ng thường: This (đ&acirc;y, n&agrave;y), that (kia, đ&oacute;), these (những c&aacute;i/người n&agrave;y), those (những c&aacute;i/người đ&oacute;)/</span></span><br>
    <span
        style="color: #333300;"><span style="font-size: 18px;">&nbsp; This is my friend (đ&acirc;y l&agrave; bạn t&ocirc;i)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;"><em>&nbsp;&nbsp;</em></span></span><em><span style="color: #333300;"><span style="font-size: 18px;">This table belongs to me (C&aacute;i b&agrave;n n&agrave;y thuộc về t&ocirc;i)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">&nbsp;&nbsp;</span><span style="font-size: 18px;">That is Tom, he is new our classmate (Đ&oacute; l&agrave; Tom, cậu ấy l&agrave; bạn c&ugrave;ng lớp mới của ch&uacute;ng ta)</span></span></em><br><em><span style="color: #333300;"><span style="font-size: 18px;">&nbsp; That house has a big dog (Ng&ocirc;i nh&agrave; đ&oacute; c&oacute; một con ch&oacute; to)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">&nbsp;&nbsp;</span><span style="font-size: 18px;">These computer are broken already (Những c&aacute;i m&aacute;y t&iacute;nh n&agrave;y bị hư rồi)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">&nbsp;&nbsp;</span></span></em>        <span style="color: #333300;"><span style="font-size: 18px;"><em>Those tree are taken care of my uncle (những c&aacute;i c&acirc;y kia được chăm s&oacute;c bởi ch&uacute; t&ocirc;i)</em></span></span>
</p>
<p><span style="color: rgb(0, 0, 139);"><span style="font-size: 24px;"><strong><u>6. Đại từ nghi vấn:</u></strong></span></span><br><span style="color: #333300;"><span style="font-size: 18px;">- D&ugrave;ng để l&agrave;m chủ ngữ hoặc t&acirc;n ngữ trong c&acirc;u hỏi:</span></span><br>
    <span
        style="color: #333300;"><span style="font-size: 18px;">- C&aacute;c đại từ nghi vấn th&ocirc;ng thường: What (c&aacute;i g&igrave;), Which(n&agrave;o), Who (ai), Whom (ai), Whose (của ai)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">- Ch&uacute; &yacute; Who d&ugrave;ng với tư c&aacute;ch l&agrave; chủ ngữ, c&ograve;n Whom d&ugrave;ng với tư c&aacute;ch t&acirc;n ngữ trong c&acirc;u</span></span><br>
        <span
            style="color: #333300;"><span style="font-size: 18px;"><em>&nbsp;&nbsp;</em></span></span><em><span style="color: #333300;"><span style="font-size: 18px;">What is this? (C&aacute;i n&agrave;y l&agrave; g&igrave;)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">&nbsp;&nbsp;</span><span style="font-size: 18px;">Which color do you prefer? (M&agrave;u n&agrave;o bạn th&iacute;ch hơn)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">&nbsp;&nbsp;</span><span style="font-size: 18px;">Who is singing? (Ai đang h&aacute;t thế)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">&nbsp;&nbsp;</span><span style="font-size: 18px;">Whom did you talk to? (Bạn đ&atilde; n&oacute;i chuyện với ai?)</span></span><br><span style="color: #333300;"><span style="font-size: 18px;">&nbsp;</span></span></em>            <span style="font-size: 18px; color: #333300;"><em>Whose book did you borrow? Bạn đ&atilde; mượn cuốn s&aacute;ch n&agrave;y của ai?)</em></span></p>
